#ifndef _MY_OPENGLAPP_1_HPP_
#define _MY_OPENGLAPP_1_HPP_
// ============================================================================
// Реализация для https://habr.com/ru/post/311808/


// ============================================================================
// Файлы заголовков Windows
#include <SDKDDKVer.h>
// Исключите редко используемые компоненты из заголовков Windows
#define WIN32_LEAN_AND_MEAN
#include <windows.h>

// ------------------------------------------------------------------
// C++
#include <string>
#include <ostream>
#include <sstream>

#include <exception>
#include <stdexcept>
#include <assert.h>


// ------------------------------------------------------------------
// Файлы заголовков GLEW
#define GLEW_STATIC
#include <GL/glew.h>

// ------------------------------------------------------------------
// Файлы заголовков GLFW
#include <GLFW\glfw3.h>


// Классы исключений и ASSERT
// ============================================================================
#include "Exception.h"


// Обратные вызовы для glfwSetKeyCallback
// ============================================================================
#include "CallBacks.h"


// ============================================================================
// Шейдеры как констатнтные строки.
#include "ConstShaders.h"

// ------------------------------------------------------------------
// Константные примитивы (треугольник, прямоугольник)...
#include "ConstPrimitives.h"



// ============================================================================
#endif
